# Задача 1. Когда используется критерий Стьюдента, а когда Z –критерий?

# Ответ: T-критерий относится к типу параметрического критерия, который применяется для определения того, как средние значения двух наборов данных отличаются друг от друга, если дисперсия не задана. Размер выборки небольшой (от 5 до 30 единиц выборки).
# Z-критерий подразумевает проверку гипотезы, которая устанавливает, отличаются ли средние значения двух наборов данных друг от друга, когда дается дисперсия. Размер выборки должен быть более 30 единиц.
# T-тест основан на t-распределении Стьюдента. Напротив, z-критерий основан на предположении, что распределение выборочных средних нормальное. T-распределение и нормальное распределение Стьюдента выглядят одинаково, так как оба симметричны и имеют форму колокола.
# Однако они отличаются в том смысле, что в t-распределении меньше места в центре и больше в хвостах.
